app/controllers/kata_controller.rb

INSERT INTO "kata" ("solutionId", "projectId", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["solutionId", "563bdfbbeb0550499000007b"], ["projectId", "563bdfbbeb05504990000079"], ["created_at", "2015-11-05 23:01:15.234158"], ["updated_at", "2015-11-05 23:01:15.234158"]]
---
  def create
    level = @current_user.level.to_s
    strategy = "kyu_#{level}_workout"
    language = params["language"]
    request = Typhoeus::Request.new(
      "https://www.codewars.com/api/v1/code-challenges/#{language}/train",
      method: :post,
      params: { stratgey: strategy },
      headers: { Authorization: "q-sizxUQz1x1tsnxuFnY", ContentType: "text/html;" }
    )
    response = request.run
    @result = JSON.parse(response.response_body)
    @setup = @result["session"]["setup"]
    projectId = @result["session"]["projectId"]
    solutionId = @result["session"]["solutionId"]

    @katum = Katum.create({ solutionId: solutionId,
              projectId: projectId });
    @current_user.kata << @katum

SELECT  "kata".* FROM "kata" INNER JOIN "socials" ON "kata"."id" = "socials"."katum_id" WHERE "socials"."user_id" = $1  ORDER BY "kata"."id" DESC LIMIT 1  [["user_id", 12]]
---
  def submit
    solutionId = @current_user.kata.last.solutionId