app/controllers/resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."password_reset_token" = $1 LIMIT 1  [["password_reset_token", "aVLZvU0knWBgPZldCD_Vn3bgaPi1EGb3U9X28zKMH1DQGPfEWR7Ra7EXBLyKLZbu"]]
---
  def edit
    @user = User.find_by(password_reset_token: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."password_reset_token" = $1 LIMIT 1  [["password_reset_token", "aVLZvU0knWBgPZldCD_Vn3bgaPi1EGb3U9X28zKMH1DQGPfEWR7Ra7EXBLyKLZbu"]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$N4liF707EWFXCwzlmxrRZ.eACIWdBKhrS4Y4vrEcvElPDnNr60gSu"], ["updated_at", "2015-11-03 00:19:04.860782"], ["id", 9]]
---
  def update
    @user = User.find_by(password_reset_token: params[:id])
    if params[:user][:password].present?
      if @user && @user.update(user_params)