app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.create user_params

SELECT  "users".* FROM "users" WHERE "users"."username" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["username", "testagain"]]
---
  def attempt_login
    if params[:username].present? && params[:password].present?
      found_user = User.where(username: params[:username]).first